In [1]:
import pandas as pd

In [15]:
data = {"id_productos": [1001,1002,1003,1003],
        "cantidad_producto":[30,None,25,25],
        "precio":[20.5,15,None,22.5]}
df =pd.DataFrame(data)
df

   id_productos  cantidad_producto  precio
0          1001               30.0    20.5
1          1002                NaN    15.0
2          1003               25.0     NaN
3          1003               25.0    22.5

In [19]:
df.isnull()

   id_productos  cantidad_producto  precio
0         False              False   False
1         False               True   False
2         False              False    True
3         False              False   False

In [21]:
df.isnull().sum()

id_productos         0
cantidad_producto    1
precio               1
dtype: int64

In [29]:
df_eliminados= df.dropna()
df_eliminados

   id_productos  cantidad_producto  precio
0          1001               30.0    20.5
3          1003               25.0    22.5

In [31]:
df.dropna()

   id_productos  cantidad_producto  precio
0          1001               30.0    20.5
3          1003               25.0    22.5

In [76]:
valores_nuevos = {"cantidad_producto":10, "precio":df["precio"].mean()}
df_rellenados = df.fillna(valores_nuevos)
df_rellenados

   id_productos  cantidad_producto     precio
0          1001               30.0  20.500000
1          1002               10.0  15.000000
2          1003               25.0  19.333333
3          1003               25.0  22.500000

In [68]:
df_rellenados["cantidad_producto"]= df_rellenados["cantidad_producto"].astype(int)
df_rellenados

   id_productos  cantidad_producto     precio
0          1001                 30  20.500000
1          1002                  0  15.000000
2          1003                 25  19.333333
3          1003                 25  22.500000

In [72]:
df_unicos = df_rellenados.drop_duplicates(subset="id_productos")
df_unicos

   id_productos  cantidad_producto     precio
0          1001                 30  20.500000
1          1002                  0  15.000000
2          1003                 25  19.333333